---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotRegenerateCorruptFamily
source: html/2a4264d1-2a89-d92c-7ef5-a7227ebf1e3d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotRegenerateCorruptFamily Property

Family [Family Name] is corrupt and its instances cannot be updated. Please reload the family to repair the project..

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRegenerateCorruptFamily { get; }
```